java从入门到精通p87
第7章：程序的控制结构
	7.1 程序的结构设计
		程序的结果包括：顺序结构、选择结构和循环结构
		7.1.1 数序结构
			开始--语句1--语句2--...--语句n--结束
			程序的语句按顺序一句一句地执行，构成了顺序结构
		7.1.2 选择结构
			选择结构也称为分支结构，根据输入数据和中间结果的不同需要选择不同的语句执行
			条件分支由if语句和if...else语句实现
		7.1.3 循环结构
	7.2 选择结构
		选择结构提供了两种类型的分支结构：条件分支和开关分支
		条件分支由if语句和if...else语句实现
		开关分支用于多个分支选择，由switch语句实现
		7.2.1 if语句
			if(条件){
				...
			}
		7.2.2 if...else语句
			if(条件){
				
			}else{
				
			}
		7.2.3 if...else if...else语句
			if(条件){
				
			}else if(条件2){
				
			}else{
				
			}
		7.2.4 条件运算符
			?:可以替代if...els语句
		7.2.5 多重选择--switch语句
			switch(表达式){
				case 选择值1:
					语句主体1;
					break;
				case 选择值2:
					语句主体2;
					break;
				default:
					语句主体;
			}
	7.3 循环结构
		7.3.1 while循环
		7.3.2 do...while循环
		7.3.3 for
	7.4 循环跳转
		break:退出某个循环
		continue:结束本次循环而立即测试循环条件，以决定是否进行下一次循环
		
		
		
		
		
		
		
		
		
		
		